{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "flatten_input"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 10, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "SparseCategoricalCrossentropy", "config": {"reduction": "auto", "name": "sparse_categorical_crossentropy", "from_logits": false, "ignore_class": null}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1sec.bin"], "weights": [{"name": "dense/kernel", "shape": [784, 50], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.2823740734773525, "scale": 0.01653894256143009, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [50], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.47106012888983184, "scale": 0.0041686737069896625, "original_dtype": "float32"}}, {"name": "dense_1/kernel", "shape": [50, 50], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.487837150517632, "scale": 0.010552036528493843, "original_dtype": "float32"}}, {"name": "dense_1/bias", "shape": [50], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4928820722243365, "scale": 0.004563722890966079, "original_dtype": "float32"}}, {"name": "dense_2/kernel", "shape": [50, 10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.8674081563949585, "scale": 0.010984753861146815, "original_dtype": "float32"}}, {"name": "dense_2/bias", "shape": [10], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.503706828285666, "scale": 0.003997673240362429, "original_dtype": "float32"}}]}]}